#+TITLE: January 31, 2018 - February 16, 2018
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE                                                         | CANCELED |
|------+------+-------------+---------+--------------------------------------------------------------+----------|
|      |      |             |         | READ.1517824350. Course DO276 (2018-02-20)                   |          |
|      |      |             |         | READ.1517824537. You Don't Know JavaScript - th (2018-02-20) |          |
|      |      |             |         | READ.1517381689. You Don't Know JavaScript - Sc (2018-02-09) |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME      | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|-----------+-----------+--------+------+-----------+--------------+------------|
| Sandeepk  |      19.0 |  13.08 | 19.0 |         0 |   2018-03-05 | ########## |
| Bhavin192 |      14.5 |  17.27 | 14.5 |         0 |   2018-03-05 | ########## |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  35 +---------------------------------------------------------------------+   
:     |   ###################################                               |   
:     |   ....                               ##              ACTUAL ####### |   
:  30 |+      ....                                            IDEAL .......+|   
:     |           ....                         #############################|   
:  25 |+              .....                                                +|   
:     |                    ....                                             |   
:     |                        ....                                         |   
:  20 |+                           ....                                    +|   
:     |                                ....                                 |   
:  15 |+                                   ....                            +|   
:     |                                        ....                         |   
:     |                                            ....                     |   
:  10 |+                                               .....               +|   
:     |                                                     ....            |   
:   5 |+                                                        ....       +|   
:     |                                                             ....    |   
:     |                                                                 ....|   
:   0 +---------------------------------------------------------------------+   
:     0       2       4        6       8       10      12       14      16      
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED |
|-----+------------+--------+-------+-----------------|
|   1 | 2018-01-31 |   33.5 |    32 |                 |
|   2 | 2018-02-01 |   33.5 |    30 |                 |
|   3 | 2018-02-02 |   33.5 |    28 |                 |
|   4 | 2018-02-03 |   33.5 |    26 |                 |
|   5 | 2018-02-04 |   33.5 |    24 |                 |
|   6 | 2018-02-05 |   33.5 |    22 |                 |
|   7 | 2018-02-06 |   33.5 |    20 |                 |
|   8 | 2018-02-07 |   33.5 |    18 |                 |
|   9 | 2018-02-08 |   33.5 |    16 |                 |
|  10 | 2018-02-09 |   26.5 |    14 | READ.1517381689 |
|  11 | 2018-02-10 |   26.5 |    12 |                 |
|  12 | 2018-02-11 |   26.5 |    10 |                 |
|  13 | 2018-02-12 |   26.5 |     8 |                 |
|  14 | 2018-02-13 |   26.5 |     6 |                 |
|  15 | 2018-02-14 |   26.5 |     4 |                 |
|  16 | 2018-02-15 |   26.5 |     2 |                 |
|  17 | 2018-02-16 |   26.5 |     0 |                 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                          | TASKID          | OWNER     | PRIORITY | TODO | ESTIMATED | ACTUAL |
|---------------------------------------------------------------+-----------------+-----------+----------+------+-----------+--------|
| TASKS                                                         |                 |           | B        |      |      33.5 |  30.35 |
|---------------------------------------------------------------+-----------------+-----------+----------+------+-----------+--------|
| Course DO276                                                  | READ.1517824350 | bhavin192 | B        | DONE |      14.5 |  17.27 |
|---------------------------------------------------------------+-----------------+-----------+----------+------+-----------+--------|
| You Don't Know JavaScript - this & Object Prototypes Part III | READ.1517824537 | sandeepK  | B        | DONE |      12.0 |   9.58 |
|---------------------------------------------------------------+-----------------+-----------+----------+------+-----------+--------|
| You Don't Know JavaScript - Scope & Closures Part II          | READ.1517381689 | sandeepK  | B        | DONE |       7.0 |   3.50 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 17
  :SPRINTSTART: <2018-01-31 Wed>
  :wpd-bhavin192: 1
  :wpd-sandeepK: 1
  :END:
** DONE Course DO276 [9/9]
   CLOSED: [2018-02-20 Tue 14:30]
   :PROPERTIES:
   :ESTIMATED: 14.5
   :ACTUAL:   17.27
   :OWNER: bhavin192
   :ID: READ.1517824350
   :TASKID: READ.1517824350
   :END:
   :LOGBOOK:
   CLOCK: [2018-02-16 Fri 23:45]--[2018-02-17 Sat 00:50] =>  1:05
   CLOCK: [2018-02-16 Fri 21:27]--[2018-02-16 Fri 21:45] =>  0:18
   CLOCK: [2018-02-15 Thu 19:07]--[2018-02-15 Thu 20:38] =>  1:31
   CLOCK: [2018-02-14 Wed 19:20]--[2018-02-14 Wed 20:18] =>  0:58
   CLOCK: [2018-02-13 Tue 20:32]--[2018-02-13 Tue 20:44] =>  0:12
   CLOCK: [2018-02-12 Mon 21:35]--[2018-02-12 Mon 22:38] =>  1:03
   CLOCK: [2018-02-12 Mon 19:55]--[2018-02-12 Mon 20:30] =>  0:35
   CLOCK: [2018-02-11 Sun 21:55]--[2018-02-11 Sun 22:50] =>  0:55
   CLOCK: [2018-02-11 Sun 18:45]--[2018-02-11 Sun 19:55] =>  1:10
   CLOCK: [2018-02-09 Fri 22:16]--[2018-02-09 Fri 23:18] =>  1:02
   CLOCK: [2018-02-09 Fri 19:00]--[2018-02-09 Fri 19:20] =>  0:20
   CLOCK: [2018-02-08 Thu 19:40]--[2018-02-08 Thu 20:10] =>  0:30
   CLOCK: [2018-02-07 Wed 19:45]--[2018-02-07 Wed 21:15] =>  1:30
   CLOCK: [2018-02-06 Tue 21:55]--[2018-02-06 Tue 22:38] =>  0:43
   CLOCK: [2018-02-05 Mon 19:25]--[2018-02-05 Mon 20:25] =>  1:00
   CLOCK: [2018-02-04 Sun 15:25]--[2018-02-04 Sun 16:50] =>  1:25
   CLOCK: [2018-02-03 Sat 13:31]--[2018-02-03 Sat 14:38] =>  1:07
   CLOCK: [2018-02-02 Fri 19:55]--[2018-02-02 Fri 20:41] =>  0:46
   CLOCK: [2018-02-01 Thu 19:39]--[2018-02-01 Thu 20:45] =>  1:06
   :END:
   - [X] Chapter 1
   - [X] Chapter 2
   - [X] Chapter 3
   - [X] Chapter 4
   - [X] Chapter 5
   - [X] Chapter 6
   - [X] Chapter 7
   - [X] Chapter 8
   - [X] Chapter 9
** DONE You Don't Know JavaScript - this & Object Prototypes Part III [4/4]
   CLOSED: [2018-02-20 Tue 14:37]
   :PROPERTIES:
   :ESTIMATED: 12.0
   :ACTUAL:   9.58
   :OWNER: sandeepK
   :ID: READ.1517824537
   :TASKID: READ.1517824537
   :END:
   :LOGBOOK:

   CLOCK: [2018-02-16 Fri 23:00]--[2018-02-17 Sat 00:00] =>  1:00
   CLOCK: [2018-02-16 Fri 20:30]--[2018-02-16 Fri 21:00] =>  0:30
   CLOCK: [2018-02-15 Thu 23:00]--[2018-02-15 Thu 23:30] =>  0:30
   CLOCK: [2018-02-14 Wed 23:00]--[2018-02-15 Thu 00:00] =>  1:00
   CLOCK: [2018-02-14 Wed 20:30]--[2018-02-14 Wed 21:00] =>  0:30
   CLOCK: [2018-02-14 Wed 00:10]--[2018-02-14 Wed 00:30] =>  0:20
   CLOCK: [2018-02-13 Tue 20:40]--[2018-02-13 Tue 21:30] =>  0:50
   CLOCK: [2018-02-12 Mon 16:40]--[2018-02-12 Mon 17:10] =>  0:30
   CLOCK: [2018-02-11 Sun 23:42]--[2018-02-12 Mon 00:42] =>  1:00

   CLOCK: [2018-02-10 Sat 23:00]--[2018-02-10 Sat 23:40] =>  0:40
   CLOCK: [2018-02-09 Fri 23:55]--[2018-02-10 Sat 00:30] =>  0:35
   CLOCK: [2018-02-08 Thu 00:00]--[2018-02-08 Thu 00:30] =>  0:30
   CLOCK: [2018-02-06 Tue 23:00]--[2018-02-07 Wed 00:00] =>  1:00
   CLOCK: [2018-02-05 Mon 23:00]--[2018-02-05 Mon 23:40] =>  0:40
   :END:
   - [X] Chapter 1: this Or That?
   - [X] Chapter 2: this All Makes Sense Now!
   - [X] Chapter 3: Objects
   - [X] Chapter 4: Mixing (Up) "Class" Objects
** DONE You Don't Know JavaScript - Scope & Closures Part II [3/3]
   CLOSED: [2018-02-09 Fri 14:47]
   :PROPERTIES:
   :ESTIMATED: 7.0
   :ACTUAL:   3.50
   :OWNER: sandeepK
   :ID: READ.1517381689
   :TASKID: READ.1517381689
   :END:
   :LOGBOOK:
   CLOCK: [2018-02-04 Sun 17:10]--[2018-02-04 Sun 18:00] =>  0:50
   CLOCK: [2018-02-02 Fri 23:00]--[2018-02-02 Fri 23:50] =>  0:50
   CLOCK: [2018-01-31 Wed 23:00]--[2018-01-31 Wed 23:50] =>  0:50
   CLOCK: [2018-02-01 Thu 23:00]--[2018-02-02 Fri 00:00] =>  1:00
   :END:
   - [X] Chapter 3: Function vs. Block Scope
   - [X] Chapter 4: Hoisting
   - [X] Chapter 5: Scope Closures
